---
kind: method
id: M:Autodesk.Revit.DB.NurbsSurfaceData.Dispose
source: html/27a918fc-a321-7712-4594-9dd7eb2d2140.htm
---
# Autodesk.Revit.DB.NurbsSurfaceData.Dispose Method

Releases all resources used by the NurbsSurfaceData

## Syntax (C#)
```csharp
public void Dispose()
```